# Taps
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'

# Binaries
brew 'bash' # Latest Bash version
brew 'coreutils' # Those that come with macOS are outdated
brew 'gh'
brew 'git'
brew 'grep'
brew 'mas' # Mac App Store manager
brew 'mackup'
# brew 'pkg-config' # https://github.com/driesvints/dotfiles/issues/20

# Apps
cask '1password'
cask 'herd'
cask 'iterm'
cask 'rectangle'
cask 'bettermouse'
# cask 'shottr'
cask 'raycast'
cask 'tailscale'
cask 'tableplus'
cask 'tinkerwell'
# cask 'ray'
# cask 'helo'
cask 'visual-studio-code'
cask 'spotify'
cask 'whatsapp'
cask 'linear-linear'
cask 'microsoft-teams'
cask 'openineditor-lite'
cask 'openinterminal-lite'
# cask 'imageoptim'
# cask 'the-unarchiver'

# Fonts
cask 'font-fira-code'

# Mac App Store
mas 'Keynote', id: 409183694
mas 'Numbers', id: 409203825
