# Taps
tap 'stripe/stripe-cli'

# Binaries
brew 'bash' # Latest Bash version
brew 'coreutils' # Those that come with macOS are outdated
brew 'gh'
brew 'git'
# brew 'grep'
# brew 'httpie'
# brew 'jq' # Used for spatie/visit
# brew 'mackup'
brew 'mas' # Mac App Store manager
# brew 'pkg-config' # https://github.com/driesvints/dotfiles/issues/20
brew 'stripe/stripe-cli/stripe'
# brew 'stripe/stripe-mock/stripe-mock'

# Apps
cask 'rectangle'
cask 'raycast'
cask '1password'
brew '1password-cli'
cask 'herd'
cask 'shottr'
cask 'google-chrome'
cask 'ghostty'
cask 'visual-studio-code'
# phpstorm
cask 'tableplus'
cask 'tinkerwell'
cask 'whatsapp'
cask 'spotify'
cask 'ray'
cask 'yaak'
cask 'orbstack'

# Utilities
cask 'bettermouse'
cask 'openineditor-lite'
cask 'openinterminal-lite'
# cask 'imageoptim'
# cask 'the-unarchiver'
cask 'age'
cask 'rye'

# Fonts
cask 'font-fira-code'

# Mac App Store
# mas 'Numbers', id: 409203825
# mas 'Keynote', id: 409183694
# PolyCapture
# Mirror Magnet
# Keystroke Pro
# Cursor Pro
