# Taps
tap 'stripe/stripe-cli'

# Binaries
brew 'bash' # Latest Bash version
brew 'coreutils' # Those that come with macOS are outdated
brew 'gh'
brew 'git'
# brew 'grep'
# brew 'httpie'
# brew 'jq' # Used for spatie/visit
# brew 'mackup'
brew 'mas' # Mac App Store manager
# brew 'pkg-config' # https://github.com/driesvints/dotfiles/issues/20
brew 'stripe/stripe-cli/stripe'
# brew 'stripe/stripe-mock/stripe-mock'

# Apps
cask 'raycast'
cask '1password'
cask '1password-cli'
cask 'herd'
cask 'shottr'
cask 'google-chrome'
cask 'ghostty'
cask 'visual-studio-code'
cask 'phpstorm'
cask 'tableplus'
cask 'tinkerwell'
cask 'whatsapp'
cask 'spotify'
cask 'ray'
cask 'yaak'
cask 'orbstack'
cask 'bettermouse'
# cask 'imageoptim'
# cask 'the-unarchiver'

# Utilities
cask 'openineditor-lite'
cask 'openinterminal-lite'
brew 'age'
brew 'rye'
brew 'cloudflared'

# Fonts
cask 'font-fira-code'

# Mac App Store
mas 'Numbers', id: 409203825
mas 'PolyCapture', id: 6504193234
mas 'Mirror Magnet', id: 1563698880
mas 'Keystroke Pro', id: 1572206224
mas 'Cursor Pro', id: 1447043133
